RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/ir_reg.h
/* 0x54 : irrx_data_word0 */
#define IRRX_DATA_WORD0_OFFSET      (0x54)
#define IR_STS_IRRX_DATA_WORD0      IR_STS_IRRX_DATA_WORD0
#define IR_STS_IRRX_DATA_WORD0_POS  (0U)
#define IR_STS_IRRX_DATA_WORD0_LEN  (32U)
#define IR_STS_IRRX_DATA_WORD0_MSK  (((1U << IR_STS_IRRX_DATA_WORD0_LEN) - 1) << IR_STS_IRRX_DATA_WORD0_POS)
#define IR_STS_IRRX_DATA_WORD0_UMSK (~(((1U << IR_STS_IRRX_DATA_WORD0_LEN) - 1) << IR_STS_IRRX_DATA_WORD0_POS))

/* 0x58 : irrx_data_word1 */
#define IRRX_DATA_WORD1_OFFSET      (0x58)
#define IR_STS_IRRX_DATA_WORD1      IR_STS_IRRX_DATA_WORD1
#define IR_STS_IRRX_DATA_WORD1_POS  (0U)
#define IR_STS_IRRX_DATA_WORD1_LEN  (32U)
#define IR_STS_IRRX_DATA_WORD1_MSK  (((1U << IR_STS_IRRX_DATA_WORD1_LEN) - 1) << IR_STS_IRRX_DATA_WORD1_POS)
#define IR_STS_IRRX_DATA_WORD1_UMSK (~(((1U << IR_STS_IRRX_DATA_WORD1_LEN) - 1) << IR_STS_IRRX_DATA_WORD1_POS))

/* 0x80 : irtx_fifo_config_0 */
#define IRTX_FIFO_CONFIG_0_OFFSET (0x80)
#define IRTX_DMA_EN               IRTX_DMA_EN
#define IRTX_DMA_EN_POS           (0U)
#define IRTX_DMA_EN_LEN           (1U)
#define IRTX_DMA_EN_MSK           (((1U << IRTX_DMA_EN_LEN) - 1) << IRTX_DMA_EN_POS)
#define IRTX_DMA_EN_UMSK          (~(((1U << IRTX_DMA_EN_LEN) - 1) << IRTX_DMA_EN_POS))
#define IR_TX_FIFO_CLR            IR_TX_FIFO_CLR
#define IR_TX_FIFO_CLR_POS        (2U)
#define IR_TX_FIFO_CLR_LEN        (1U)
#define IR_TX_FIFO_CLR_MSK        (((1U << IR_TX_FIFO_CLR_LEN) - 1) << IR_TX_FIFO_CLR_POS)
#define IR_TX_FIFO_CLR_UMSK       (~(((1U << IR_TX_FIFO_CLR_LEN) - 1) << IR_TX_FIFO_CLR_POS))
#define IR_RX_FIFO_CLR            IR_RX_FIFO_CLR
#define IR_RX_FIFO_CLR_POS        (3U)
#define IR_RX_FIFO_CLR_LEN        (1U)
#define IR_RX_FIFO_CLR_MSK        (((1U << IR_RX_FIFO_CLR_LEN) - 1) << IR_RX_FIFO_CLR_POS)
#define IR_RX_FIFO_CLR_UMSK       (~(((1U << IR_RX_FIFO_CLR_LEN) - 1) << IR_RX_FIFO_CLR_POS))
#define IR_TX_FIFO_OVERFLOW       IR_TX_FIFO_OVERFLOW
#define IR_TX_FIFO_OVERFLOW_POS   (4U)
#define IR_TX_FIFO_OVERFLOW_LEN   (1U)
#define IR_TX_FIFO_OVERFLOW_MSK   (((1U << IR_TX_FIFO_OVERFLOW_LEN) - 1) << IR_TX_FIFO_OVERFLOW_POS)
#define IR_TX_FIFO_OVERFLOW_UMSK  (~(((1U << IR_TX_FIFO_OVERFLOW_LEN) - 1) << IR_TX_FIFO_OVERFLOW_POS))
#define IR_TX_FIFO_UNDERFLOW      IR_TX_FIFO_UNDERFLOW
#define IR_TX_FIFO_UNDERFLOW_POS  (5U)
#define IR_TX_FIFO_UNDERFLOW_LEN  (1U)
#define IR_TX_FIFO_UNDERFLOW_MSK  (((1U << IR_TX_FIFO_UNDERFLOW_LEN) - 1) << IR_TX_FIFO_UNDERFLOW_POS)
#define IR_TX_FIFO_UNDERFLOW_UMSK (~(((1U << IR_TX_FIFO_UNDERFLOW_LEN) - 1) << IR_TX_FIFO_UNDERFLOW_POS))
#define IR_RX_FIFO_OVERFLOW       IR_RX_FIFO_OVERFLOW
#define IR_RX_FIFO_OVERFLOW_POS   (6U)
#define IR_RX_FIFO_OVERFLOW_LEN   (1U)
#define IR_RX_FIFO_OVERFLOW_MSK   (((1U << IR_RX_FIFO_OVERFLOW_LEN) - 1) << IR_RX_FIFO_OVERFLOW_POS)
#define IR_RX_FIFO_OVERFLOW_UMSK  (~(((1U << IR_RX_FIFO_OVERFLOW_LEN) - 1) << IR_RX_FIFO_OVERFLOW_POS))
#define IR_RX_FIFO_UNDERFLOW      IR_RX_FIFO_UNDERFLOW
#define IR_RX_FIFO_UNDERFLOW_POS  (7U)
#define IR_RX_FIFO_UNDERFLOW_LEN  (1U)
#define IR_RX_FIFO_UNDERFLOW_MSK  (((1U << IR_RX_FIFO_UNDERFLOW_LEN) - 1) << IR_RX_FIFO_UNDERFLOW_POS)
#define IR_RX_FIFO_UNDERFLOW_UMSK (~(((1U << IR_RX_FIFO_UNDERFLOW_LEN) - 1) << IR_RX_FIFO_UNDERFLOW_POS))

/* 0x84 : irtx_fifo_config_1 */
#define IRTX_FIFO_CONFIG_1_OFFSET (0x84)
#define IR_TX_FIFO_CNT            IR_TX_FIFO_CNT
#define IR_TX_FIFO_CNT_POS        (0U)
#define IR_TX_FIFO_CNT_LEN        (3U)
#define IR_TX_FIFO_CNT_MSK        (((1U << IR_TX_FIFO_CNT_LEN) - 1) << IR_TX_FIFO_CNT_POS)
#define IR_TX_FIFO_CNT_UMSK       (~(((1U << IR_TX_FIFO_CNT_LEN) - 1) << IR_TX_FIFO_CNT_POS))
#define IR_RX_FIFO_CNT            IR_RX_FIFO_CNT
#define IR_RX_FIFO_CNT_POS        (8U)
#define IR_RX_FIFO_CNT_LEN        (7U)
#define IR_RX_FIFO_CNT_MSK        (((1U << IR_RX_FIFO_CNT_LEN) - 1) << IR_RX_FIFO_CNT_POS)
#define IR_RX_FIFO_CNT_UMSK       (~(((1U << IR_RX_FIFO_CNT_LEN) - 1) << IR_RX_FIFO_CNT_POS))
#define IR_TX_FIFO_TH             IR_TX_FIFO_TH
#define IR_TX_FIFO_TH_POS         (16U)
#define IR_TX_FIFO_TH_LEN         (2U)
#define IR_TX_FIFO_TH_MSK         (((1U << IR_TX_FIFO_TH_LEN) - 1) << IR_TX_FIFO_TH_POS)
#define IR_TX_FIFO_TH_UMSK        (~(((1U << IR_TX_FIFO_TH_LEN) - 1) << IR_TX_FIFO_TH_POS))
#define IR_RX_FIFO_TH             IR_RX_FIFO_TH
#define IR_RX_FIFO_TH_POS         (24U)
#define IR_RX_FIFO_TH_LEN         (6U)
#define IR_RX_FIFO_TH_MSK         (((1U << IR_RX_FIFO_TH_LEN) - 1) << IR_RX_FIFO_TH_POS)
#define IR_RX_FIFO_TH_UMSK        (~(((1U << IR_RX_FIFO_TH_LEN) - 1) << IR_RX_FIFO_TH_POS))

/* 0x88 : ir_fifo_wdata */
#define IR_FIFO_WDATA_OFFSET  (0x88)
#define IR_TX_FIFO_WDATA      IR_TX_FIFO_WDATA
#define IR_TX_FIFO_WDATA_POS  (0U)
#define IR_TX_FIFO_WDATA_LEN  (32U)
#define IR_TX_FIFO_WDATA_MSK  (((1U << IR_TX_FIFO_WDATA_LEN) - 1) << IR_TX_FIFO_WDATA_POS)
#define IR_TX_FIFO_WDATA_UMSK (~(((1U << IR_TX_FIFO_WDATA_LEN) - 1) << IR_TX_FIFO_WDATA_POS))

/* 0x8C : ir_fifo_rdata */
#define IR_FIFO_RDATA_OFFSET  (0x8C)
#define IR_RX_FIFO_RDATA      IR_RX_FIFO_RDATA
#define IR_RX_FIFO_RDATA_POS  (0U)
#define IR_RX_FIFO_RDATA_LEN  (16U)
#define IR_RX_FIFO_RDATA_MSK  (((1U << IR_RX_FIFO_RDATA_LEN) - 1) << IR_RX_FIFO_RDATA_POS)
#define IR_RX_FIFO_RDATA_UMSK (~(((1U << IR_RX_FIFO_RDATA_LEN) - 1) << IR_RX_FIFO_RDATA_POS))

struct ir_reg {
    /* 0x0 : irtx_config */
    union {
        struct {
            uint32_t cr_irtx_en             : 1; /* [    0],        r/w,        0x0 */
            uint32_t cr_irtx_out_inv        : 1; /* [    1],        r/w,        0x0 */
            uint32_t cr_irtx_mod_en         : 1; /* [    2],        r/w,        0x0 */
            uint32_t cr_irtx_swm_en         : 1; /* [    3],        r/w,        0x0 */
            uint32_t cr_irtx_data_en        : 1; /* [    4],        r/w,        0x1 */
            uint32_t cr_irtx_logic0_hl_inv  : 1; /* [    5],        r/w,        0x0 */
            uint32_t cr_irtx_logic1_hl_inv  : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7             : 1; /* [    7],       rsvd,        0x0 */
            uint32_t cr_irtx_head_en        : 1; /* [    8],        r/w,        0x1 */
            uint32_t cr_irtx_head_hl_inv    : 1; /* [    9],        r/w,        0x0 */
            uint32_t cr_irtx_tail_en        : 1; /* [   10],        r/w,        0x1 */
            uint32_t cr_irtx_tail_hl_inv    : 1; /* [   11],        r/w,        0x0 */
            uint32_t cr_irtx_frm_en         : 1; /* [   12],        r/w,        0x0 */
            uint32_t cr_irtx_frm_cont_en    : 1; /* [   13],        r/w,        0x0 */
            uint32_t cr_irtx_frm_frame_size : 2; /* [15:14],        r/w,        0x0 */
            uint32_t cr_irtx_data_num       : 7; /* [22:16],        r/w,       0x1f */
            uint32_t reserved_23_31         : 9; /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_config;

    /* 0x4 : irtx_int_sts */
    union {
        struct {
            uint32_t irtx_end_int      : 1; /* [    0],          r,        0x0 */
            uint32_t irtx_frdy_int     : 1; /* [    1],          r,        0x1 */
            uint32_t irtx_fer_int      : 1; /* [    2],          r,        0x0 */
            uint32_t reserved_3_7      : 5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t cr_irtx_end_mask  : 1; /* [    8],        r/w,        0x1 */
            uint32_t cr_irtx_frdy_mask : 1; /* [    9],        r/w,        0x1 */
            uint32_t cr_irtx_fer_mask  : 1; /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_15    : 5; /* [15:11],       rsvd,        0x0 */
            uint32_t cr_irtx_end_clr   : 1; /* [   16],        w1c,        0x0 */
            uint32_t rsvd_17           : 1; /* [   17],       rsvd,        0x0 */
            uint32_t rsvd_18           : 1; /* [   18],       rsvd,        0x0 */
            uint32_t reserved_19_23    : 5; /* [23:19],       rsvd,        0x0 */
            uint32_t cr_irtx_end_en    : 1; /* [   24],        r/w,        0x1 */
            uint32_t cr_irtx_frdy_en   : 1; /* [   25],        r/w,        0x1 */
            uint32_t cr_irtx_fer_en    : 1; /* [   26],        r/w,        0x1 */
            uint32_t reserved_27_31    : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_int_sts;

